uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/drivers/display_controller.c
/**
 * @file display_controller.c
 * @brief STM32H7A3 raster display-controller implementation.
 *
 * This driver implements the hardware-independent display-controller contract
 * using the STM32H7A3 LTDC peripheral and LTDC layer 1.
 */

#include "display_controller.h"

#include "STM32H7A3_Defs.h"
#include "rcc.h"
#include "stm32h7a3xxq.h"

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

/* -------------------------------------------------------------------------- */
/* Private configuration                                                      */
/* -------------------------------------------------------------------------- */

#define DISPLAY_CONTROLLER_REGISTRY_SIZE               1U
#define DISPLAY_CONTROLLER_MAX_PALETTE_ENTRIES         256U
#define DISPLAY_CONTROLLER_PIXEL_CLOCK_TOLERANCE_PCT   3U

#define DISPLAY_CONTROLLER_GPIO_MODE_ALTERNATE         2U
#define DISPLAY_CONTROLLER_GPIO_SPEED_VERY_HIGH        3U

#define DISPLAY_CONTROLLER_BLEND_FACTOR_1_CA           0x06U
#define DISPLAY_CONTROLLER_BLEND_FACTOR_2_CA           0x07U

#define DISPLAY_CONTROLLER_CLUT_INDEX_POSITION         24U
#define DISPLAY_CONTROLLER_CLUT_RED_POSITION           16U
#define DISPLAY_CONTROLLER_CLUT_GREEN_POSITION         8U
#define DISPLAY_CONTROLLER_CLUT_BLUE_POSITION          0U

/* -------------------------------------------------------------------------- */
/* Private types                                                              */
/* -------------------------------------------------------------------------- */

/**
 * @brief Runtime state associated with one initialized display controller.
 */
typedef struct
{
    DisplayController_Handle *handle;
    DisplayController_LayerConfiguration layer;
    bool initialized;
    bool layer_configured;
    bool enabled;
} DisplayController_State;

/* -------------------------------------------------------------------------- */
/* Private data                                                               */
/* -------------------------------------------------------------------------- */

static DisplayController_State DisplayController_Registry[DISPLAY_CONTROLLER_REGISTRY_SIZE];

/* -------------------------------------------------------------------------- */
/* Private function declarations                                              */
/* -------------------------------------------------------------------------- */

static DisplayController_State *DisplayController_FindState(const DisplayController_Handle *controller);
static DisplayController_State *DisplayController_AllocateState(DisplayController_Handle *controller);
static DisplayController_Result DisplayController_ValidateConfiguration(const DisplayController_Handle *controller);
static DisplayController_Result DisplayController_ValidateLayer(const DisplayController_Handle *controller, const DisplayController_LayerConfiguration *layer);
static DisplayController_Result DisplayController_ValidatePins(const DisplayController_PinConfiguration *pins);
static DisplayController_Result DisplayController_ValidateRequiredPin(DisplayController_Pin pin);
static DisplayController_Result DisplayController_ValidateColorPins(const DisplayController_Pin pins[8]);
static GPIO_TypeDef *DisplayController_GetGPIOPort(DisplayController_Pin pin);
static uint32_t DisplayController_GetGPIOPinNumber(DisplayController_Pin pin);
static DisplayController_Result DisplayController_GetAlternateFunction(DisplayController_Pin pin, uint32_t *alternate_function);
static DisplayController_Result DisplayController_ConfigurePin(DisplayController_Pin pin);
static DisplayController_Result DisplayController_ConfigurePins(const DisplayController_PinConfiguration *pins);
static DisplayController_Result DisplayController_ConfigureGlobalRegisters(const DisplayController_Handle *controller);
static DisplayController_Result DisplayController_ConfigureLayerRegisters(const DisplayController_Handle *controller, const DisplayController_LayerConfiguration *layer);
static uint32_t DisplayController_CalculatePixelClock(const DisplayController_Timing *timing);
static uint32_t DisplayController_GetPixelFormatEncoding(DisplayController_PixelFormat pixel_format);
static uint32_t DisplayController_GetBytesPerPixel(DisplayController_PixelFormat pixel_format);
static DisplayController_Result DisplayController_ReloadImmediate(void);
static DisplayController_Result DisplayController_ReloadVerticalBlanking(void);

/* -------------------------------------------------------------------------- */
/* State registry                                                             */
/* -------------------------------------------------------------------------- */

static DisplayController_State *DisplayController_FindState(const DisplayController_Handle *controller)
{
    size_t index;

    if (controller == NULL)
    {
        return NULL;
    }

    for (index = 0U; index < DISPLAY_CONTROLLER_REGISTRY_SIZE; index++)
    {
        if (DisplayController_Registry[index].initialized && (DisplayController_Registry[index].handle == controller))
        {
            return &DisplayController_Registry[index];
        }
    }

    return NULL;
}

static DisplayController_State *DisplayController_AllocateState(DisplayController_Handle *controller)
{
    size_t index;

    for (index = 0U; index < DISPLAY_CONTROLLER_REGISTRY_SIZE; index++)
    {
        if (!DisplayController_Registry[index].initialized)
        {
            DisplayController_Registry[index].handle = controller;
            DisplayController_Registry[index].layer_configured = false;
            DisplayController_Registry[index].enabled = false;

            return &DisplayController_Registry[index];
        }
    }

    return NULL;
}

/* -------------------------------------------------------------------------- */
/* GPIO helpers                                                               */
/* -------------------------------------------------------------------------- */

static GPIO_TypeDef *DisplayController_GetGPIOPort(DisplayController_Pin pin)
{
    uint32_t port_index;

    if (pin == DISPLAY_CONTROLLER_PIN_UNUSED)
    {
        return NULL;
    }

    port_index = ((uint32_t)pin >> 4U) & 0x0FU;

    switch (port_index)
    {
        case 0U:
            return GPIOA;

