uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/drivers/display_controller.c
    LTDC_Layer1->CFBLNR = (uint32_t)layer->height;

    if (layer->pixel_format == DISPLAY_CONTROLLER_PIXEL_FORMAT_INDEXED_8_BIT)
    {
        LTDC_Layer1->CR |= LTDC_LxCR_CLUTEN;
    }

    return DISPLAY_CONTROLLER_RESULT_OK;
}

static DisplayController_Result DisplayController_ReloadImmediate(void)
{
    LTDC->SRCR = LTDC_SRCR_IMR;

    return DISPLAY_CONTROLLER_RESULT_OK;
}

static DisplayController_Result DisplayController_ReloadVerticalBlanking(void)
{
    LTDC->SRCR = LTDC_SRCR_VBR;

    return DISPLAY_CONTROLLER_RESULT_OK;
}

/* -------------------------------------------------------------------------- */
/* Public functions                                                           */
/* -------------------------------------------------------------------------- */

DisplayController_Result DisplayController_Init(DisplayController_Handle *controller)
{
    DisplayController_State *state;
    DisplayController_Result result;

    result = DisplayController_ValidateConfiguration(controller);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    if (DisplayController_FindState(controller) != NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_OK;
    }

    state = DisplayController_AllocateState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_BUSY;
    }

    if (RCC_EnablePeripheralClock(LTDC) != RCC_RESULT_OK)
    {
        return DISPLAY_CONTROLLER_RESULT_IO_ERROR;
    }

    if (RCC_ResetPeripheral(LTDC) != RCC_RESULT_OK)
    {
        return DISPLAY_CONTROLLER_RESULT_IO_ERROR;
    }

    result = DisplayController_ConfigurePins(&controller->pins);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ConfigureGlobalRegisters(controller);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    LTDC_Layer1->CR &= ~LTDC_LxCR_LEN;
    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

    result = DisplayController_ReloadImmediate();

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    state->initialized = true;
    state->layer_configured = false;
    state->enabled = false;

    return DISPLAY_CONTROLLER_RESULT_OK;
}

DisplayController_Result DisplayController_ConfigureLayer(DisplayController_Handle *controller, const DisplayController_LayerConfiguration *layer)
{
    DisplayController_State *state;
    DisplayController_Result result;

    if ((controller == NULL) || (layer == NULL))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (state->enabled)
    {
        return DISPLAY_CONTROLLER_RESULT_BUSY;
    }

    result = DisplayController_ValidateLayer(controller, layer);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ConfigureLayerRegisters(controller, layer);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    state->layer = *layer;
    state->layer_configured = true;

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_SetFramebuffer(DisplayController_Handle *controller, void *framebuffer)
{
    DisplayController_State *state;

    if ((controller == NULL) || (framebuffer == NULL))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (!state->layer_configured)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    state->layer.framebuffer = framebuffer;
    LTDC_Layer1->CFBAR = (uint32_t)(uintptr_t)framebuffer;

    if (state->enabled)
    {
        return DisplayController_ReloadVerticalBlanking();
    }

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_SetPalette(DisplayController_Handle *controller, const uint32_t *palette, size_t count)
{
    DisplayController_State *state;
    size_t index;
    uint32_t color;

    if ((controller == NULL) || (palette == NULL) || (count == 0U) || (count > DISPLAY_CONTROLLER_MAX_PALETTE_ENTRIES))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (!state->layer_configured)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (state->layer.pixel_format != DISPLAY_CONTROLLER_PIXEL_FORMAT_INDEXED_8_BIT)
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    LTDC_Layer1->CR &= ~LTDC_LxCR_CLUTEN;

    for (index = 0U; index < count; index++)
    {
        color = palette[index] & 0x00FFFFFFUL;

        LTDC_Layer1->CLUTWR =
            ((uint32_t)index << DISPLAY_CONTROLLER_CLUT_INDEX_POSITION) |
            (((color >> 16U) & 0xFFU) << DISPLAY_CONTROLLER_CLUT_RED_POSITION) |
            (((color >> 8U) & 0xFFU) << DISPLAY_CONTROLLER_CLUT_GREEN_POSITION) |
            (((color >> 0U) & 0xFFU) << DISPLAY_CONTROLLER_CLUT_BLUE_POSITION);
    }

    LTDC_Layer1->CR |= LTDC_LxCR_CLUTEN;

    if (state->enabled)
    {
        return DisplayController_ReloadVerticalBlanking();
    }

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_Enable(DisplayController_Handle *controller)
{
    DisplayController_State *state;

    if (controller == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (state->enabled)
    {
        return DISPLAY_CONTROLLER_RESULT_OK;
    }

    if (!state->layer_configured)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    LTDC_Layer1->CR |= LTDC_LxCR_LEN;
    LTDC->GCR |= LTDC_GCR_LTDCEN;

    state->enabled = true;

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_Disable(DisplayController_Handle *controller)
{
    DisplayController_State *state;

    if (controller == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (!state->enabled)
    {
        return DISPLAY_CONTROLLER_RESULT_OK;
    }

    LTDC_Layer1->CR &= ~LTDC_LxCR_LEN;
    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

    state->enabled = false;

    return DisplayController_ReloadImmediate();
}